senator/app/Controllers/Shared.php

    public function isLoggedIn()
    {
        $userModel = new UserModel();

        // Get the user's email from session
        $email = session()->get('user_email');

        // Check if the session contains user email
        if ($email !== null) {
            // Attempt to retrieve the user from the database based on the email
            $userModel = $userModel;
            $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'favourakak@gmail.com'
 LIMIT 1